/*다차원배열
: 2차원 배열 : 자료형 배열명[세로크기][가로크기]
: 3차원 배열 : int arr4[3][3][3]; 크기를 뒤에서 부터 읽는다. 3 X 3크기를 가진 배열공간이 3개있다는 의미

2차원 배열 쓸때 
int arr2[2][3] = { 
  { 1, 2, 3 },
  { 4, 5, 6 },
 }

 3차원 배열
 int arr3[2][2][2] = {
 { 1, 2, 4 }
 { 5, 6, 7 }
 }
 {
 { 1, 2, 4 }
 { 5, 6, 7 }
 }
 {
 { 1, 2, 4 }
 { 5, 6, 7 }
 }
*/

#include <stdio.h>

int main(void)
{
#pragma region 다차원 배열 사용하기(8.3.3)
	int arr3[4][2] = {
		{ 1, 2 },
		{ 3, 4 },
		{ 5, 6 },
		{ 7, 8 }
	};

	arr3[3][0] = 9;
	arr3[3][1] = 10;

	for (int i = 0; i < 4; i++) {
		for (int j = 0; j < 2; j++) {
			printf("2차원 배열의 값[%d][%d] : %d\n", i, j, arr3[i][j]);
		}
		printf("\n");
	}



#pragma endregion 


#pragma region 다차원 배열 사용하기(8.3.3.2)
	int arr4[3][3][3] = {
		{
			{ 1, 2, 3 },
			{ 4, 5, 6 },
			{ 7, 8, 9 }
		},
		{
			{ 10, 11, 12 },
			{ 13, 14, 15 },
			{ 16, 17, 18 }
		},
		{
			{ 19, 20, 21 },
			{ 22, 23, 24 },
			{ 25, 26, 27 }
		}
	};

	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 3; j++) {
			for (int k = 0; k < 3; k++) {
				printf("3차원 배열의 값[%d][%d][%d] : %d\n", i, j, k, arr4[i][j][k]);
			}
			printf("\n");
		}
		printf("\n");
	}



#pragma endregion

	return 0;
}